       IDENTIFICATION DIVISION.
       PROGRAM-ID.       HELLO-WORLD.
       AUTHOR.           RICKOSHI.
       INSTALLATION.     FATEC-SP.
       DATE-WRITTEN.     23/09/2025.
       DATE-COMPILED. 
       SECURITY.         APENAS O AUTOR PODE MODIFICA-LO.
      *REMARKS.          IMPRIME A MENSAGEM "HELLO WORLD!".

       PROCEDURE DIVISION.
           DISPLAY "HELLO WORLD!".
           STOP RUN.


      * APENAS OS SEGUINTES COMANDOS SAO NECESSARIOS PARA EXECUCAO:
      * IDENTIFICATION DIVISION. 
      * PROGRAM-ID. 
      * PROCEDURE DIVISION. 
      * DISPLAY "HELLO WORLD!". 
      * STOP RUN. 
